const resource = `
1 A公司混合云平台项目范围管理解决方案

1.1 项目启动过程
项目启动是指正式开始一个项目或项目的下一个阶段的启动过程。这是指A公司的混合云管理平台项目正式启动。项目启动过程将明确项目的目标是什么，项目包括的一般工作范围，项目人员的组织结构，项目管理的技术方法等。俗话说 “工欲善其事，必先利其器”，虽然好的开始不会是项目成功的一半，但失败的项目肯定会让你的项目一开始就陷入泥潭和困境。项目的启动过程是否完善，对下一步项目的顺利进行具有示范作用。
１. 项目启动过程输出一个重要的文档，即项目章程。
项目章程会明确说明项目的范围和组织资源的投入，并对项目的范围做一个粗略的描述。这个文档将指导之后的项目范围管理工作。项目章程对项目经理的权限、项目团队成员各自的职责以及其他利益相关者在项目中的职责进行了说明，这也为项目的不同角色在后续的项目范围管理中更好地完成自己的工作提供了明确的规定，从而促进与项目利益相关者的沟通，并帮助工作更加有序地进行。项目章程需要得到项目干系人的批准和授权。授权一旦获得批准，就意味着一个项目正式启动。
２. 项目启动过程明确项目的管理流程。
由于A公司混合云管理平台项目需求不明确，变更频繁，工期短等问题及特点，本次项目管理流程采用敏捷开发模式，Scrum是敏捷开发的典型方法，Scrum于1995年由Advanced Development Methodologies，Inc提出，并2001年“敏捷联盟（Agile Alliance）”形成后受到了很多欢迎。敏捷方法强调软件产品的持续交付，拥抱变化，注重团队沟通和用户的即时反馈，被称为 “轻量级” 过程。敏捷开发模式，以用户需求为核心，采用短期迭代、分步开发，适合在需求频繁变化的情况下快速输出具有核心功能的小版本，在后续周期中根据市场需求变化，不断迭代，改进产品。
虽然项目是经过短期迭代的，但是也要对比整个项目的交付时间框架对其进行追踪和管理。在每个迭代过程在，首先跟踪开发进度、支出成本和bug率走势，然后进行汇总并估算整个项目的进程，跟踪整个项目完成进度。敏捷型方法在工作任务分解上区别传统方法，工作内容和工作顺序不由项目经理确定，而是利用项目成员的专业技能进行工作任务拆分并完成任务。在敏捷方法中，项目经理主要负责高层次的工作目标，项目研发团队有一定的自由度安排在一定时间内实现目标的方法和工作顺序。
３. 组建敏捷项目团队Scrum团队中通常包括三个角色，他们分别是Scrum Master、Product Owner和Dev Team。
Product Owner在本项目中是产品经理，负责构建正确的产品。具体工作如下：
① 负责对Product Backlog（产品需求清单）进行的整理、优化、优先级排序等；
② 负责决定团队每个Sprint将完成哪些任务；
③负责实现产品价值最大化，开发团队发挥能力最大化，随着项目组织、Scrum团队以及单个团队成员的不同，实现这一工作的方式也会不同；
③ Product Owner应检查产品质量，对产品的质量把关。质量决定了产品的命运。；
Dev Team在本项目中为开发团队，负责以正确的方式构建产品，通常是跨部门临时组建的团队，人员10人以内，业务能力强；
Scrum Master在本项目中视为项目经理，主要负责推动项目进展和结果，帮助整个项目团队理解和实践Scrum价值观和原则，具体来说：
①管理Scrum流程，召开每一个站会；
②控制需求变更，虽然scrum本就是应对需求变更频繁设 计出的方法，但是范围的变更依然要有规则可依据；
③做好团队建设工作，比如开发团队状态不佳，项目经理可以组织团队营造活跃的氛围，增强团队凝聚力。
在A公司以往的项目管理中，大多数由项目优先级和项目目标的变化引起的项目范围的变化，通常都根植于公司的领导层。因此，在项目组中增设技术总监，进行辅助管理。甲公司技术总监属于项目经理的上级，负责整个公司项目的全面管理，技术总监的介入可以为项目提供更高层次的指导、支持、监督和控制。一方面可以防止由于工作优先级的变化 (特别是突然的变化) 而导致项目的 “范围蔓延”，另一方面可以防止公司领导人员任意影响项目目标。
４. 选择项目管理软件
按照以往的组织经验，项目组成员将利用Jira项目管理软件进行项目执行阶段管理。Jira使用流程图如图4-2。
 
图4-2 Jira使用流程图
Jira核心基于敏捷方法scrum管理思想，系统分为两大部分，产品管理和项目管理，具体包括测试管理、计划管理、发布管理、文档管理、事务管理等功能，能够在一个软件中将软件研发过程中的需求、任务、bug、用例、计划、发布等要素逻辑性的跟踪管理起来。Jira管理系统的整个管理理念符合本项目的研发理念，项目组成员可以实时了解项目范围的变更，跟踪项目进度，项目设计发布，项目研发团队可以在此工具上进行需求关联，任务分解，编写测试用例，bug提交，回归测试等一系列敏捷开发工作，减少无意义的沟通成本，提高了研发效率，项目经理可以跟踪研发进度，了解项目组成员的工作状态，及时进行进度管理。
５. 识别项目干系人
上一章对于混合云平台项目范围管理问题分析中，我们知道A公项目范围的变更，有部分原因是项目利益方对项目的整体范围不够了解，所以在本项目中，建议项目经理要与项目干系人及时沟通，为了避免项目经理在沟通上浪费过多时间，明确项目中与干系人沟通的优先级，即识别干系人。如图4-3。
 
图4-3干系人分析
识别干系人我们不仅要把干系人分析寻找出来，而且需要对每个干系人对项目的要求和预期，对项目做出的贡献、产生的影响及约束等等进行辨别。这些方面都需要事无巨细的归纳整合记下来，为后续管理做准备。
对于不同优先级的项目干系人，在项目管理时管理者应该采用不同的管理策略，根据著名的“二八定律”，我们决定在沟通中应该选择将大部分精力用到影响80％项目的重点人员上，具体如下：
权力大且项目利益相关性高干系人要重点管理，他们往往具有话语权和影响力，也很注重项目成果，项目管理者应该“重点关注”，跟他们及时沟通项目相关问题，确认项目目标，使其能够积极的参与到项目中来；经常与这些利益相关者沟通，并听取他们的想法和建议，保证他们的满意度。这类干系人常常是项目的客户、主管领导。
权力大但项目利益相关性低的要使他们对项目基本满意，这类干系人他们具有话语权和影响力，但是对项目不过多关注，项目管理者应该定期向这一区域的人汇报项目的最新进度，他们更关注结果，过程不需要了解。我们需要确保这类干系人对项目基本满意，并尽可能保持项目进度不受他们影响。
权力小但项目利益相关性高的要随时告知，这一区域的人非常重视项目成果，因为会直接影响自身利益。所以跟这类干系人管理者要保持随时告知的态度，项目的进度、变更详情等对项目有影响的事情都要随时通知他们。
权力小但项目利益相关性高的要随时告知，这一区域的人非常重视项目成果，因为会直接影响自身利益。因此，具有此类利益相关者的管理者应保持随时告知的态度，随时告知他们项目的进度、变更细节等影响项目的事项。
明确以上几个方面后，召开项目启动会，目的如下：
1） 宣布项目正式开始，以便所有项目干系人都能了解项目
2） 构建项目团队，任命项目经理
3） 明确之后工作的管理规则
4） 提高项目成员工作热情

1.2 项目范围规划
在项目正式启动后，首先要做的一项重要任务就是项目范围规划。项目范围规划将进一步形成各种文件，常见的有范围管理计划、需求管理计划，并以此为指导进行项目范围管理。古语说: “预则立，不预则废!".所以，项目范围规划工作为项目的所有范围管理工作提供基础和指导。
项目范围规划最重要的作用是为在整个项目周期中如何进行范围管理提供方向。范围计划阶段一般会根据项目章程、项目管理计划、环境因素、组织过程资产，通过专家判断、数据分析、会议等技术，输出范围管理计划和需求管理计划。敏捷开发是根据A公司的混合云管理平台采用的。敏捷开发的概念还在于可以工作运转起来的的软件比全面的文档要更好。

1.2.1  编制项目范围管理计划
项目范围管理计划的目的是说明在项目过程中将如何进行项目范围管理，详细地包括如何定义范围，如何制定工作分解结构，以及如何验证和控制范围。如果项目没有项目范围管理计划，项目团队在以后遇到项目管理中的问题时，如需求变化、设计出现错误等 “意外” 的情况，就会缺乏指导性的行动方针。对于用户提出的新要求，要么全说不，全说是，要么全凭想象说是或不是，整个决策都会非常不准确，这无疑会严重打击项目团队的积极性，降低客户满意度对项目的成功非常不利。所以，编制项目范围管理计划十分重要。具体过程如图4-4。
 
图4-4编制项目范围管理计划输入、工具和方法、输出
A公司混合云管理平台在启动阶段即决定采用敏捷开发模式，敏捷开发模式可以避免因频繁的需求变更造成的范围失控，比较适合A公司混合云管理平台这种需求变化快的项目。
在项目范围管理计划中会明确整个项目生命周期中对于沟通、变更、问题的处理方法。在沟通方面，避免浪费时间的无用文件，多进行会议沟通和小组沟通。文档只保留高效进度所需的指导团队，如需求规格说明书、产品原型、需求评审会议纪要、需求确认表、需求阶段的需求变更申请表；在研发阶段的接口文档、任务分解、提交测试报告等。在变更方面，如果工作量超过3天，则必须提交需求变更表并通过电子邮件确认后才能实施；问题方面，如研发团队24小时内无法确定的问题，请技术总监支持。
项目范围管理计划对每个版本的范围管理做初步计划，在每一个迭代开始时，项目需要确任该版本的范围并将上一版本未完成项归入当前版本，按照优先级执行。每次迭代都会重复需求集合，范围定义和工作分解。范围控制工作将始终存在。

1.3 需求收集
A公司以往自主研发项目经验表明，项目需求收集环节比较随意，过于主观和片面，造成这种现象可能的原因是，项目发起人是公司的高层领导，项目成员可以随时联系，随时的询问项目需求，所以在收集需求方面不够严谨；还有人们总喜欢待在自己的“舒适区”，以自己的主观臆断判断需求，用自己熟悉的技术方法收集需求，只针对较容易发现的需求，造成需求挖掘。
A公司以前存在需求分析不完整、需求理解片面、需求无法量化、需求无法追踪等问题。为了解决这些问题，在设计需求收集的计划时，我们注重科学的收集方法，并根据不同的环境使用不同的方法。
A公司的混合云管理项目平台通过以下方式收集需求：
１. 座谈
项目发起人一般并不能一次性清晰的描述到底需要什么，座谈的目的一方面了解项目发起人的产品构思，一方面帮助项目发起人理清产品思路。所以，这也要求参与座谈的人员做好准备，提前了解同类产品领域市场需求，用户痛点，市场特点等。座谈过程中需要包括一名技术专家，以确保采集来的业务需求能够准确无误地“翻译”成技术要求。范围沟通记录表如表4-1。
表4-1需求范围沟通记录表
沟通日期 记录人 沟通过程信息 责任人 备注
2022.01.05 产品A同学 ……
产品开通变配表单实现可自主配置
…… 需求方
B同学 
 
 

２. 用户市场需求调查
对目标用户进行需求调查。做市场调查，很重要的一点是选择全面合适的调查对象。通过分析可能使用混合云管理平台系统的潜在用户的需求，得出能够代表大部分用户的真实需求。
具体来说从以下几个方面选择调查对象：
1）不同规模的企业用户：500人以上规模的大型企业用户，100-500人规模的中型企业用户，10-100人规模的小型企业用户，10人以下的微型企业用户；
2）不同业务领域的企业用户: 传统制造、媒体、游戏和自媒体行业的用户；
3）自由工作者。
调查方式选用调查问卷形式，调查问卷选择线上调查问卷形式。线上调查问卷相比较传统纸质调查问卷具有以下几个特点：
1）传播速度快
传统调查问卷会在一个调查点采用向路人发放问卷的形式，由于路人时间紧、对问卷存在警惕性等原因，导致问卷发放效率非常低，被调查者的质量也不稳定，每天能有效发放100多张问卷己经是比较困难的事情，传播速度慢。但是，线上调查问卷就不一样，依托强大的社交软件，快速收集调查问卷不是难事。
2）节省人力成本
传统的问卷为了在短时间内获得大量的样本数据，需要数十名调查者到不同的场所同时发放问卷，等待问卷的填写、回收和分类；线上调查问卷只需要1到2个调查员利用公司资源项目调查对象分享问卷链接即可，节省人力成本。
3）便于统计汇总
传统问卷收集后，需要手工汇总问卷内容；线上调查问卷拥有强大的统计功能，问卷结果更加直观。

３.竞品功能分析
竞品功能分析将通过收集混合云行业竞品，例如T云、H云、A云等行业内混合云产品，整理竞品的需求、优缺点，得出竞品分析报告。竞争分析报告包括竞争分析目的、行业背景、竞争选择、竞争分析及相关结论等内容。竞品分析表如表4-2。

表4-2竞品功能分析表示例
功能 T混合云
平台 H混合云
平台 A混合云
平台 其他
混合云平台
功能A T表现方式 H表现方式 暂无 暂无
 
 


1.专家会议
将座谈、用户市场需求调查、竞品分析三个方面的出的结果汇总，召开专家会议，利用会议讨论，头脑风暴方法，确定下来最终的用户市场需求，按照需求优先级整理项目需求列表，项目需求列表模板如表4-3。
¬¬
表4-3项目需求列表模板
编号 名称 描述 优先级 备注
数字递增 功能名称 功能简单描述 P0：最高，必须完成
P1：中等，碰到无法解决问题时可以延后
P2：低，工期紧张是可以延后 补充


1.4 项目范围定义过程
项目范围一般来说包括广品范围和项目泡围两部分，广品泡围指广品父付物的具体范围，项目范围指项目的工作范围产品范围决定着项目范围，项目范围服务于产品范围。项目范围定义是将项目范围更加细化到较小，更易管理的部分。它对于项目而言十分重要，具有三点作用：
1）它增加项目时间、成本和资源预估的准确度，项目的范围定义清楚了，具体工作的内容也明确了，产品的特征和可交付成功也定义明细了，这时候对使用的时间、费用和资源的估算就会更精确，规避了拍脑袋定义的项目风险；
2）定义了实施项目控制的依据；
3）明确了相关责任人在项目中的责任。
基于上述，在A公司的混合云管理平台项目中，项目范围定义主要输出详细的项目范围规范、软件需求规范，并建立范围变更团队。

1.5.1  项目范围说明书
项目范围说明书是项目范围管理的基础文件，是项目范围管理的基础。它与项目章程中的范围描述不同，前者将更加详细。A公司混合云管理平台项目中，项目范围说明书将根据需求收集阶段的需求文档填写范围说明书。项目范围说明书将明确属于此次项目必做的和可不做的，也列出了可交付的成果。项目范围说明书模板见表4-4。
表4-4范围说明书
范围说明书
项目名称：                                           日期：
序号 名称 内容
1 项目背景和说明 描述项目的进行方式，参与人员和目的
2 项目范围 定义项目的界线，将项目范围视作一个设想的盒子，这将装入全部项目元素
3 高级要求 描绘项目的高级要求，如：能够允许内部用户无需下载任何软件即可接入使用
4 可交托结果 列出将受此项目影响的机构、利益关联人或部门，并描述了它们将如何遇到影响。例如：混合云平台接入后可能有部分业务内容外露在在公网，需谨慎处理
5 受影响的项 列出将受此项目影响的业务流程或系统，并描绘他们将怎样遇到影响，如：运维人员不再使用命令行方式查询日志id，而使用图形化界面进行获取
6 从范围中清除的特定项 描述了从后续项目中清除的任何特定部分
7 实施计划 描绘准备怎样实行项目，如：项目的所有部分将同时展开还是逐渐进行，各个迭代版本将主要包含哪些内容
8 高级日程表/计划 参见各部分的Jira记录
9 验收标准 为使可交付成果被验收需要满足的标准

项目范围根据项目章程中的项目描述和需求描述，对范围进一步详细描述；项目可交付成果会罗列所以需要交付内容，一般会附加详情表；项目目标是项目是否成功的标准，要包括时间、成本和质量目标，并且在目标描述上尽量量化，尽量避开不能数据衡量的目标。

1.5.2  软件需求说明书
软件需求说明书时为了让客户和项目组成员双方对软件的初始规定有一个共同的理解而编制的，它以工作范围说明书、解决方案以及对用户的需求收集作为编写依据。软件需求说明书会是整个开发工作的根基，也是概要设计的依据。需求说明书说明的内容，主要是对项目产品特点和属性进行描述，由于涉及的内容较多，为了避免内容遗漏，可以通过项目需求说明书编写要点进行对比。项目需求说明书编写要点对照表如表4-5所示：
需求说明书
内容 说明
改动记录 记录文档修改记录，包含修改内容、时间及人物
综合评审 如有必要，填写综合评审邀请和会议记录
需求背景 描述需求背景
预期收益 说明需求的预期收益
需求详情 首先一句话概括需求方案，其次进行细节描述，若有交互需添加交互图
埋点方案 若有埋点添加，技术评审前需完成相关埋点设计，包含：实现方式（新增/复用）、产品、操作系统、触发时机、相关参数
翻译平台 国际化文案平台对应任务链接
表4-5需求说明书编写要点对照表

1.5 创建工作分解结构
工作分解结构定义了项目的全部范围，对项目团队为实现项目目标，交付成果所必须做的全部工作进行曾经分解。由于需要事无巨细的分解，项目经理单独完成需要耗费相当大的时间精力，所以项目经理无需亲自完成所有的项目任务，项目经理所要进行的是将项目需求按照大的功能模块进行划分，再将其交给项目组成员，来完成项目的进一步工作分解。公司A混合云管理平台1.0版本WBS分解如图4-6所示，由于系统较大，本文只在“资源管理”任务下继续进行WBS分解。
 
图4-6 A公司混合云管理平台1.0版本WBS分解
A公司的混合云管理平台按照1.0版的功能模块进行分解，分解后的工作包按照自上而下的原则分配给具体负责人。比如一个像该项目WBS中的“弹性计算”模块将会由产品经理规划整个产品实现的详细功能与人机交互，由架构师进行架构设计，再由设计、开发人员将其实现，测试人员验证功能是否完善，所以一个工作包将会有多个人共同完成，在项目管理软件中不同角色将对其认领。
在进行工作包分配时采用召开会议的形式，依据WBS和产品原型，将工作分配到具体负责人。对WBS工作包的进一步分解采用项目组成员共同参与的形式，利用公司项目管理工具，即Jira管理系统，将任务由大到小依次进行分解。项目经理将任务分成几大模块，并将大的模块向下关联到具体开发人员，由开发人员继续进行任务细化，最后根据项目组成员划分好的工作进行汇总，得出工时，将其与工期比对，对工作时间进行调整与项目组成员确认。

1.6 项目范围核实过程
项目范围核实过程需要召集所有重要的干系人，尤其是对项目范围影响比较大的人。这个过程的难点在于沟通，所以在进行项目范围审查会时，范围宣讲员需要对范围和后续可交付成果有一个详细的了解，产品的用户或利益接受者在询问范围的问题时可以给出一个回应方案。这个过程会用到前面输出的多个文档，比如有范围说明书、WBS分解图、产品原型等。
范围验证将正式确认项目的范围，项目需求发起者，如项目客户和项目发起人，将需要在过程中审查和确定项目的范围。常见的方式是采用会议和邮件形式，会上共同评审范围，没有问题的话，签署需求确认单，会后发正式的范围确认邮件，通知所有干系人，但本次项目采用了Jira的项目管理方式，因此无需签署文件和邮件发送，只要在项目需求单对应的流程节点位置，由实际干系人和项目客户以及项目发起人点击“完成节点”即可，点击即表示已确认项目需求的范围，并对此负责。

1.7 项目范围变更控制过程
范围变更控制是指对可能引起变更的因素以及已经发生的变更的控制。任何项目在执行过程中都会经历范围变更，敏捷型的项目更是如此。从根本上讲这是由于项目最终的使用者需求，难以避免或受市场或受技术发展的影响。在项目管理中，我们不排除范围变更，但是没有规则的变更在很大程度上会导致项目失败。所以如何建立一个科学的变更流程，识别哪些是真的需要变更的，哪些不是必须的，确保变更带来的影响是可控的。
明确项目范围变更流程，项目范围变更之前需要先确认变更类型，是细化原有需求，还是新增需求。细化需求的需要明确给客户指出需求变更所造成的从时间进度，交付成果方面的影响。如果是新的需求，则需要技术人员和业务人员评估工作时间，然后与客户协商是否需要增加成本或不增加新的需求。
需求变更带来的工时超过3天/人的需要填写需求变更申请单并发送邮件给上级领导，获得领导批示后开始执行。需求变更申请单见表4-6。

需求变更申请单
项目名称：                                     申请时间：yyyy-mm-dd
申请人 部门+姓名
变更类型 新增、优化、删除
变更原因 变更理由
变更优先级 高（P0）中（P1）低（P2）
变更描述 变更的具体内容，包括变更前、变更后的变更，以及额外的影响
备注 
在敏捷项目中，提交一个版本后，根据业务优先级和团队能力对未完成的列表进行排序，并将前面的任务分配给下一个迭代器，以便在下一个版本中完成。客户在提出新的变更后，业务代表首先会咨询项目团队，获得技术人员的技术意见之后，变更请求和缺陷报告进行评审，将变更或缺陷进行优先级排序，然后列入未完成清单。
这种把变更和原本工作编入同一张任务清单的方式，为了应对随时变化的项目外部环境。在这种环境中，变更没有办法从原来的项目计划中抽离出来。把变更和原计划工作任务整合到一张未完项清单中，有利于对所有待完成任务进行重新排序，有利于对任务进行分配。生命周期中如何应对变更，在每一个版本范围确认之后，尽量不进行大范围的需求更改。面对需求的变更，第一步是划分变更类型和变更优先级。原则上，将新功能放入下一个迭代版本，以完善当前功能的要求。除了必须更改的高优先级任务外，新功能还被放入下一个迭代版本中。
 
5 A公司企业及混合云平台项目范围管理方案实施
通过项目启动、范围规划、需求收集、范围定义、创建工作分解结构、范围验证、范围变更等方式给出解决方案，避免A公司混合云管理平台范围管理中前期项目的范围管理问题。本章将进行应用实施并对实施后应用效果评估。A公司混合云管理平台在布局热点领域，丰富自身生态上具有十分重要的作用，因此，做好混合云管理平台项目对A公司的发展具有重大意义。
5.1 项目应用实践
本节重点介绍R公司智能云会议平台在项目范围管理中可能出现的问题，并根据上一节给出的项目解决方案应用到项目中。
首先，项目启动过程中，由于项目需求变化频繁、市场变化快、开发周期短等原因，决定按照敏捷生命周期，采用经典的Scrum方法对项目进行管理。实施过程中并没有照搬Scrum方法，而是结合A公司自身的项目管理方法，形式具有A公司特色的Scrum管理。

1．组建Scrum项目团队。
Scrum 团队中的三种角色，分别是Scrum Master、Product Owner和Dev Team。
Scrum Master在本项目中为项目经理，Product Owner为产品经理，Dev Team在本项目中为开发团队。为避免无法控制高层领导提出的要求，增设技术总监协助项目。技术总监是项目经理的高层管理人员，拥有较多的话语权。如果项目经理不能沟通，可以向技术总监求助。
混合云管理平台由于项目较为庞大，组织架构上除总项目经理外，对每个层级的细分模块也添加了项目经理进行跟踪管理，本文中只细化到“弹性计算”模块，其他模块类似，如图5-1所示。
 
图5-1混合云平台项目组织架构
其中，对于每个子模块（以“弹性计算”为例）：
 项目经理1人，主要负责项目整体进度管理，结合Jira管理平台，进行每天站会的组织，保证项目正常实施；
 技术总监1人，属于辅助配合，有需要时假如项目，并进行技术指导或人力补充，因内容相对重复且耦合性较高，可能出现一人担任多个子模块的技术总监职务的现象；
 产品经理1人，主要负责输出此需求的详细产品形态，输出PRD（产品需求说明书）；
 设计团队包含UI界面设计和UE交互设计，UI界面设计同学主要负责界面样式以及各组件展示效果的设计，UE交互设计同学主要负责人机交互的逻辑处理，包含点击跳转逻辑、布局逻辑等，UI和UE经常会合作完成一份设计稿；
 研发团队主要包含：
o 架构师1人，主要负责整体子模块程序架构、网络铺设等全链路设计；
o 后端工程师6人，其中至少1人担任基建工程师，主要负责后端项目工程搭建、组件整合等基础建设，其余人员主要负责业务功能开发；
o 前端工程师3人，其中1人担任基建工程师，主要负责前端项目工程搭建、组件库整合、工具类撰写等基础建设，其余人员主要负责业务功能开发，包括并不限于界面开发、交互逻辑开发等。
开发人员分别来自混合云部门、公司内部产品基建部门以及PAAS技术部门。

2．进行需求分析，产出产品原型图和设计稿。
通过座谈、竞品分析、市场调查、专家判断等方法收集项目需求挖掘项目隐形需求，然后以产品原型图的方式进行展示。
其中，市场调查问卷，选择500人以上规模的大型企业4家，500-100人规模的中型企业3家，100人-10人规模的小型企业3家，10人以下的微型企业3家，对其员工发放调查问卷，问卷设计中选择了市场上比较有竞争性的云会议产品，从使用频率，满意度，是否选择付费等多个领域进行调查。市场调查问卷设计如图5-2。
         
图5-4 混合云用户使用调查问卷3
然后对收集到的产品需求进行分析整理，并以产品设计稿的形式进行展示，更方便项目干系人理解范围边界和产品逻辑。由于系统复杂，此处只列出首页仪表盘（如图5-5）和弹性计算实例列表及操作（如图5-6）的设计稿。
 
图5-5 混合云管理平台首页仪表盘设计稿
 
图5-6 混合云管理平台弹性计算实力列表设计稿

3．项目WBS工作分解。
首先项目经理与产品充分沟通并对项目进行初步的WBS工作分解，再由各子模块项目经理进行二次分解，并全部将其录入到Jira管理系统中，如图5-7，此处因系统庞大，子模块只展示运营控制台中的“资源管理”部分。
 
图5-7 混合云管理平台工作WBS分解

接下来，项目组成员在Jira管理系统中各自认领对应需求和模块，进一步进行需求拆解和划分，工作拆分原则是尽量将需求细化到每个单独的任务点，每个Task（任务）尽量不要超过2天，即16小时，工作拆分中需求列表如图5-8所示，按模块拆分，各子模块需求根据实际情况，由实际开发人员补充Task在其中，由于内容较多，此处只展示“弹性计算”中的部分任务拆分，如图5-9。
 
图5-8 项目需求拆分图

 
图5-9 弹性计算部分任务拆分图

4．制定项目范围变更控制规则
在敏捷方法中，一个又一个的迭代构成了整个项目生命周期。在范围控制变更中，尽量在单次迭代过程中保持项目的需求和范围不变，并在下次迭代开始时引导客户主动优化需求和范围。版本迭代周期是几天取决于需求和范围易变的程度，混合云管理平台将迭代期定位10-14天。每一次版本迭代，项目范围管理都遵循范围规划-需求收集-范围定义-工作分解结构-范围核实-范围变更控制流程。
在每个迭代周期内，尽量控制没有新需求的增加，新需求划分到下一个版本中。面对客户反馈问题，范围控制遵循如下流程，如图5-10。
 
图5-10 客户反馈处理流程图

综合来看，遇到客户反馈问题时，首先项目对接负责人会优先介入，也会根据问题的级别判断是否需要进行商务洽谈增加费用等，从这一步就一定程度上控制了优先级低的需求提出；从客户反馈流程图上也可以看出，在组织架构中加入的技术总监发挥了作用，在遇到超过4小时无法定位问题时，请求领导协助。
倘若遇到需求优先级高的需求和不得不进行需求细化的紧急需求更改，整个项目组按Scrum开发流程图中规则进行，如图5-11。
 
图5-11 Scrum开发流程图

遇到紧急需求调整，首先会中段当前周期，召开项目成员会议，对需求调整带来的影响进行评估，影响较小的将纳入版本开发计划中，按原开发流程进行；影响较大的，请求领导给予资源支持，比如从其他部门调拨人员进行支援，或者适当延长版本周期等。
通过1.组建Scrum项目团队 2.进行需求收集分析，生成产品UI界面 3.优化项目工作分解 4.制定项目范围变更控制规则，A公司混合云平台项目实施过程中，避免了项目需求蔓延问题，员工返工，项目需求随意更改等项目范围问题

5.2 项目应用效果评估
上一节将解决方案应用到A公司混合云管理平台，本节将对应用后的效果进行评估。A公司项目管理的目标就是客户满意，公司满意，员工满意。所以采用项目调查问卷形式对项目满意度进行调查，验证范围管理实施效果。
调查对象选择与项目关系最为紧密的，除了项目干系人，还包括项目组成员所在不同部门的部门经理，旨在从不同维度去判断项目是否令人满意，收集到更加真实、客观的数据。具体被调查者有：项目发起人1名、IM部门经理1名、测试部经理1名，创新研发部经理1名，市场部经理1名，项目组成员11名，共16名。
问卷采用匿名形式，记名问卷容易使调查对象不能表达内心真实想法，匿名问卷打消了这种顾虑，提高问卷的真实性。问卷内容如图5-12：
      
图5-12 A公司混合云管理平台项目管理满意度调查问卷

其中1题为单选题，2-8题为评分题，评分分为非常满意（5分），比较满意（4分），一般（3分），比较不满意（2分），非常不满意（1分）五个选项，选择一般，比较不满意，非常不满意会有输入框填入不满意的原因（选填），10题为开放性问题，旨在听一下各个方面的声音，改进之后工作。
通过对项目组成员及领导层对于项目满意度的调查，对比实施项目范围管理前后的效果。通过分析每道题目在所有调查者完成后所取得的平均成绩可以看出，项目整体管理评分3.6分，如表5-1。
表5-1 项目整体管理统计分析表
 
通过汇总调查问卷，对问卷结果进行分析得出，A公司混合云管理平台的整个管理过程基本是令人满意的。研究的本意是规范项目范围管理，结果也表明，项目范围管理中范围描述、范围变更流程、范围控制结构是得到项目干系人满意的。项目范围的成功管理也影响了交付物的满意，项目进度的满意。
但在对项目工作建议中，我们发现，建议最多的是在沟通方面，多人反映沟通繁琐，跨部门沟通效率低等问题。
通过问卷调查，可以初步得出本文对项目范围管理的研究是有效的。在A公司混合云治管理平台项目的应用过程中，应对A公司范围的方案是有效的。公司领导和项目组成员满意。改方案是值得在A公司以后的项目管理活动中继续应用的。
调查结果同样也反映了一些平常看不到的问题，比如在项目沟通流畅性的保证这些具体的工作上，还有些不尽如人意的地方，在对于项目建议上，多人指出项目在沟通上存在问题。项目组很多成员对沟通不满意，表示希望沟通更简单，提高沟通效率。两方面都指出项目管理中语言艺术的重要性，这也将是本文作者下一步将要努力的方向。

`
